app/Providers/AppServiceProvider.php

select * from `channels`
---
    public function boot()
    {
        \view()->composer('*', function ($view) {
            $channels = \Cache::rememberForever('channels', function () {
                return Channel::all();
            });
            $view->with('channels', $channels);
        });